Tekla.Structures.ModelInternal.IEventHandler


Tekla.Structures.ModelInternal.IEventHandler.AddListener(Tekla.Structures.Model.IEvents)


Tekla.Structures.ModelInternal.IEventHandler.RemoveListener(Tekla.Structures.Model.IEvents)


Tekla.Structures.ModelInternal.IEventHandler.AddUIListener(Tekla.Structures.ModelInternal.dotClientId_t,Tekla.Structures.ModelInternal.IInputGeometryEvents)


Tekla.Structures.ModelInternal.IEventHandler.RemoveUIListener(Tekla.Structures.ModelInternal.dotClientId_t,Tekla.Structures.ModelInternal.IInputGeometryEvents)


Tekla.Structures.ModelInternal.IEventHandler.SubscribeEvent(System.String,Tekla.Structures.Model.IEvents)
Subscribes an event listener to the event
eventName:  name of the event to subscribe to
eventListener:  Event Listener who is interested in the event
Returns: success/failure
Remarks:  Current support is only to subscribe for ViewCameraChanged event

Tekla.Structures.ModelInternal.IEventHandler.UnsubscribeEvent(System.String,Tekla.Structures.Model.IEvents)
Unsuscribes an event listener to the event
eventName:  name of the event to subscribe to
eventListener:  Event Listener who is interested in the event
Returns: success/failure
Remarks:  Current support is only to unssubscribe ViewCameraChanged event